"Downloading file '%@'" = "Сваляне на файла '%@'";
"Uploading file '%@'" = "Качване на файла '%@'";
"Deleting file '%@'" = "Изтриване на файла '%@'";
"Creating folder '%@'" = "Създаване на папка '%@'";
"File Deletion" = "Изтриване на файл";
"No" = "Не";
"Yes" = "Да";
"Finding Duplicates..." = "Намиране на дублиращи се файлове...";
"Deleting track" = "Изтриване на песен";
"Changing tag for track" = "Сменяне на tag-а на песента";
"bytes" = "байтове";
"Quit XNJB" = "Изключи XNJB";
"There are still items in the queue.  Are you sure you want to quit?  This could crash your NJB and/or XNJB." = "Все още има активност в queue. Сигурни ли сте, че искате да затворите програмата. Това може да повреди вашият плейър и/или XNJB.";
"Connecting to NJB" = "Свързване с плейъра";
"Disconnecting from NJB" = "Прекъсване на връзката с плейъра";
"Connect to NJB" = "Свързване с плейъра";
"It appears that we are already connected. Do you want to try to connect again?" = "Изглежда, че вече има осъществена връзка. Желаете ли да се свържете отново?";
"Connect" = "Свързване";
"Disconnect" = "Прекъсване на връзката";
"Downloading track '%@'" = "Сваляне на песен '%@'";
"Uploading track '%@'" = "Качване на песен '%@'";
"Changing tag for track '%@'" = "Сменяне на tag-а на песента '%@'";
"Deleting track '%@'" = "Изтриване на песента '%@'";
"Are you sure you want to delete the selected local files?" = "Сигурни ли сте, че искате да изтриете избраните локални файлове?";
"There was an error deleting file %@." = "Имаше грешка при изтриването на файла %@.";
"Selected %d out of %d" = "Избрани %d от %d";
"Could not discover any jukeboxes" = "Не можаха да се открият никакви jukeboxes";
"Could not locate any jukeboxes" = "Не можаха да се намерят никакви jukeboxes";
"Not connected" = "Не е осъществена връзка";
"Speed %@ Mbps" = "Скорост %@ Mbps";
"Charging" = "Зареждане";
"Battery charged or not present" = "Батерията е заредена или не съществува.";
"Running off battery" = "Батерията свършва";
"Getting playlists" = "Сваляне на списъка с песни";
"Updating playlist %@" = "Обновяване на списъка с песни %@";
"Deleting playlist %@" = "Изтриване на списъка с песни %@";
"Playlist Deletion" = "Изтриване на списъка с песни";
"Are you sure you want to delete the selected playlist off the NJB?" = "Сигурни ли сте че искате да изтриете избрания списък с песни от плейъра?";
"Save Preferences" = "Запазване на Настройките";
"Do you want to save changes to preferences?" = "Искате ли да запазите промените на настройките?";
"Cancel" = "Спри";
"Queued" = "Изчаква...";
"Running" = "В процес на Изпълнение";
"Finished" = "Завършено";
"Error" = "Грешка";
"Cancelled" = "Прекъснато";
"Getting Jukebox settings" = "Сваляне на настройките на jukebox-a";
"Setting Owner Name To %@" = "Нагласяне на името на Собственика %@";
"Setting Time To %@" = "Нагласяне на час %@";
"Connected" = "Свързан";
"Disconnected" = "Не Свързан";
"No NJB Devices Found" = "Плейъра не беше намерен";
"Could Not Open NJB" = "Не беше намерен достъп до плейъра";
"Could Not Capture NJB" = "Не можа да се прихване плейъра";
"Uploading Track" = "Качване на Песен";
"Uploading File" = "Качване на Файл";
"Downloading Track List" = "Сваляне на Списъка с Песни";
"Downloading File List" = "Сваляне на Списъка с Файлове";
"Updating Track Tag" = "Качване на новия tag";
"Downloading Track" = "Сваляне на Песента";
"Deleting Track" = "Изтриване на Песента";
"Downloading File" = "Сваляне на Файла";
"Connecting" = "Свързване";
"Disconnecting" = "Изключване";
"Deleting File" = "Изтриване на файла";
"Downloading Jukebox Settings" = "Сваляне на настройките на Jukebox-а";
"Updating Jukebox Settings" = "Обновяване на настройките на Jukebox-а";
"Downloading Playlists" = "Сваляне на Списъка с Песни";
"Updating Playlist" = "Обновяване на списъка с Песниt";
"Deleting Playlist" = "Изтриване на списъка с Песни";
"Creating Folder" = "Създаване на Папка";
"Unknown Status" = "Незнаен статус";
"KB" = "KB";
"MB" = "MB";
"GB" = "GB";
"OK" = "OK";
"iTunes Library" = "iTunes Библиотека";
"Could not load iTunes library from" = "не можа да се зареди iTunes библиотеката от";
"Getting file list" = "Сваляне на файловия списък";
"Your player does not support this file type: please convert to a different type" = "Вашият плейър не потдържа този формат файлове: моля конвертирайте файла в друг формат.";
"You can't upload non-music files in the music tab - please use the data tab" = "Не можете да качвате други файлове от тук - моля използвайте data tab";

"Are you sure you want to delete the selected items off the device?" = "Are you sure you want to delete the selected items off the device?";
"New Playlist" = "New Playlist";
